<a href="https://colab.research.google.com/github/ZiYu-Huang/Practices-for-Beginners/blob/main/Day12.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#DataFrame遺失值處理

In [1]:
import pandas as pd
import numpy as np

In [2]:
test = pd.DataFrame([[1,2,3,None],[4,None,5,6],[None,7,8,9],[10,11,None,12],[13,14,15,16]],columns=['one','two','thr','four'],dtype=np.int)
test

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: DeprecationWarning: `np.int` is a deprecated alias for the builtin `int`. To silence this warning, use `int` by itself. Doing this will not modify any behavior and is safe. When replacing `np.int`, you may wish to use e.g. `np.int64` or `np.int32` to specify the precision. If you wish to review your current use, check the release note link for additional information.
Deprecated in NumPy 1.20; for more details and guidance: https://numpy.org/devdocs/release/1.20.0-notes.html#deprecations
  """Entry point for launching an IPython kernel.

    one   two   thr  four
0   1.0   2.0   3.0   NaN
1   4.0   NaN   5.0   6.0
2   NaN   7.0   8.0   9.0
3  10.0  11.0   NaN  12.0
4  13.0  14.0  15.0  16.0

#isnull、notnull
回傳空值

In [ ]:
test.isnull() #將資料空值回傳True，不是空值回傳False

     one    two    thr   four
0  False  False  False   True
1  False   True  False  False
2   True  False  False  False
3  False  False   True  False
4  False  False  False  False

In [ ]:
test.notnull() #相反，資料空值回傳False，不是空值回傳True

     one    two    thr   four
0   True   True   True  False
1   True  False   True   True
2  False   True   True   True
3   True   True  False   True
4   True   True   True   True

#drop、dropna
拿掉空值

In [ ]:
test.drop([0,1]) #拿掉0、1這兩個raw
#drop可用來拿掉你指定的raw或column
#axis參數預設為0，axis=0時drop掉raw、axis=1時drop掉column

    one   two   thr  four
2   NaN   7.0   8.0   9.0
3  10.0  11.0   NaN  12.0
4  13.0  14.0  15.0  16.0

In [ ]:
test.drop(['one','thr'],axis=1) #拿掉one,thr這兩個column

    two  four
0   2.0   NaN
1   NaN   6.0
2   7.0   9.0
3  11.0  12.0
4  14.0  16.0

In [ ]:
test.dropna() #只有index是4的那排raw沒有遺失值，所以只剩下那排
# dropna可拿掉有遺失值的raw
# 與drop一樣，axis預設為0
# axis=0時drop掉有空值的raw、axis=1時drop掉有空值的column

    one   two   thr  four
4  13.0  14.0  15.0  16.0

In [ ]:
test.dropna(axis=1) #因為全部的column都有遺失值，所以輸出結果如此

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

#fillna
補充缺失值

方式一:以字典的方式傳入，前面是column名稱，後面是補充缺失值的值

方式二:單一欄位補充缺失值

In [ ]:
test.fillna({'one':'fill_one','two':'fill_two'})

        one       two   thr  four
0         1         2   3.0   NaN
1         4  fill_two   5.0   6.0
2  fill_one         7   8.0   9.0
3        10        11   NaN  12.0
4        13        14  15.0  16.0

In [ ]:
test['one'].fillna("99999")

0        1
1        4
2    99999
3       10
4       13
Name: one, dtype: object